createuser.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="false">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <DebugSampler guiclass="TestBeanGUI" testclass="DebugSampler" testname="Debug Sampler" enabled="true">
          <boolProp name="displayJMeterProperties">false</boolProp>
          <boolProp name="displayJMeterVariables">true</boolProp>
          <boolProp name="displaySystemProperties">false</boolProp>
        </DebugSampler>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
<<<<<<< HEAD
        <stringProp name="ThreadGroup.num_threads">50</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
=======
<<<<<<< HEAD
        <stringProp name="ThreadGroup.num_threads">1</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.delayedStart">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
=======
        <stringProp name="ThreadGroup.num_threads">5</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
>>>>>>> 492b5c612879d7753332980b74e2e3d8b77080e1
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
>>>>>>> 26d18f5e0bdf3040b080b727330a06ca17867833
        <stringProp name="ThreadGroup.duration">10800</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments">
            <elementProp name="auth" elementType="Argument">
              <stringProp name="Argument.name">auth</stringProp>
              <stringProp name="Argument.value">eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiJDQ0FESUciLCJleHAiOjE4NzM5OTc2MjgsImlhdCI6MTY5Mzk5NzYyOH0.ab5C1juD7jL3Om-Ly4m8VV8PTTNQoZwul-Mt4q3E3pfxySW9vg8zUeef08v-pvCb8gviTslokWlS0vYjovyIYA</stringProp>
              <stringProp name="Argument.metadata">=</stringProp>
            </elementProp>
          </collectionProp>
        </Arguments>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="authenticate" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">&#xd;
{&#xd;
    &quot;username&quot;: &quot;CCADIG&quot;,&#xd;
    &quot;password&quot;: &quot;password&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">onramp-qa.int.capinet</stringProp>
          <stringProp name="HTTPSampler.port">8443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">bb-bancs-digital-tcs-onboarding-v1/onboarding/authenticate</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">https://onramp-qa.int.capinet:8443/bb-bancs-digital-tcs-onboarding-v1/onboarding/authenticate</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON Extractor" enabled="false">
            <stringProp name="JSONPostProcessor.referenceNames">token</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.token</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="BeanShell PostProcessor" enabled="false">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">import org.apache.jmeter.protocol.http.control.Header;

props.put(&quot;token&quot;,vars.get(&quot;token&quot;));
ctx.getCurrentSampler().getHeaderManager().add(new Header(&quot;Authorization&quot;,&quot;Bearer &quot;+props.get(&quot;token&quot;)));
log.info(ctx.getCurrentSampler().getHeaderManager().getHeaders().toString());</stringProp>
          </BeanShellPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="registerUser" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;cif&quot;: &quot;${Cust_No}&quot;,&#xd;
    &quot;user_role&quot;: &quot;Business Customer&quot;,&#xd;
    &quot;mthr_mdn_nm&quot;: &quot;Nomvuyo&quot;,&#xd;
    &quot;scrty_qstn&quot;: &quot;In which city where you born?&quot;,&#xd;
    &quot;scrty_answr&quot;: &quot;In which city where you born&quot;,&#xd;
    &quot;cnfrm_scrty_answr&quot;: &quot;In which city where you born&quot;,&#xd;
    &quot;ntfcn_md&quot;: &quot;Email &amp; SMS&quot;,&#xd;
    &quot;email&quot;: &quot;vusipelo@capitecbank.co.za&quot;,&#xd;
    &quot;mbl_nmbr&quot;: &quot;27834085207&quot;,&#xd;
    &quot;frst_nm&quot;: &quot;Xolelwa&quot;,&#xd;
    &quot;lst_nm&quot;: &quot;Magazi&quot;,&#xd;
    &quot;bsns_nm&quot;: &quot;LELWAS PROJECT (PTY)LTD&quot;,&#xd;
    &quot;dual_Authorization&quot;: &quot;No&quot;,&#xd;
    &quot;full_Mandate&quot;: &quot;Yes&quot;,&#xd;
    &quot;super_user_auth&quot;: &quot;Yes&quot;&#xd;
},&#xd;
&quot;DateTime&quot;: &quot;2023-08-18T08:17:52.3618969+00:00&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">onramp-qa.int.capinet</stringProp>
          <stringProp name="HTTPSampler.port">8443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">bb-bancs-digital-tcs-onboarding-v1/onboarding/registerUser</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">false</boolProp>
          <boolProp name="HTTPSampler.image_parser">false</boolProp>
          <boolProp name="HTTPSampler.concurrentDwn">false</boolProp>
          <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
          <boolProp name="HTTPSampler.md5">false</boolProp>
          <intProp name="HTTPSampler.ipSourceType">0</intProp>
          <stringProp name="TestPlan.comments">https://onramp-qa.int.capinet:8443/bb-bancs-digital-tcs-onboarding-v1/onboarding/registerUser</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers"/>
          </HeaderManager>
          <hashTree/>
          <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="BeanShell PreProcessor" enabled="false">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">import org.apache.jmeter.protocol.http.control.Header;
import com.github.javafaker.Faker;


ctx.getCurrentSampler().getHeaderManager().add(new Header(&quot;Authorization&quot;,&quot;Bearer &quot;+props.get(&quot;token&quot;)));
log.info(ctx.getCurrentSampler().getHeaderManager().getHeaders().toString());


 Faker faker = new Faker (new Locale(&quot;en-ZA&quot;));
 vars.put(&quot;Email_Address&quot;,faker.internet().emailAddress();

 </stringProp>
          </BeanShellPreProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="registerUser-test" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;cif&quot;: &quot;1014477&quot;,&#xd;
    &quot;user_role&quot;: &quot;Business Customer&quot;,&#xd;
    &quot;mthr_mdn_nm&quot;: &quot;Nomvuyo&quot;,&#xd;
    &quot;scrty_qstn&quot;: &quot;In which city where you born?&quot;,&#xd;
    &quot;scrty_answr&quot;: &quot;In which city where you born&quot;,&#xd;
    &quot;cnfrm_scrty_answr&quot;: &quot;In which city where you born&quot;,&#xd;
    &quot;ntfcn_md&quot;: &quot;Email &amp; SMS&quot;,&#xd;
    &quot;email&quot;: &quot;vusipelo@capitecbank.co.za&quot;,&#xd;
    &quot;mbl_nmbr&quot;: &quot;27834085207&quot;,&#xd;
    &quot;frst_nm&quot;: &quot;Xolelwa&quot;,&#xd;
    &quot;lst_nm&quot;: &quot;Magazi&quot;,&#xd;
    &quot;bsns_nm&quot;: &quot;LELWAS PROJECT (PTY)LTD&quot;,&#xd;
    &quot;dual_Authorization&quot;: &quot;No&quot;,&#xd;
    &quot;full_Mandate&quot;: &quot;Yes&quot;,&#xd;
    &quot;super_user_auth&quot;: &quot;Yes&quot;&#xd;
},&#xd;
&quot;DateTime&quot;: &quot;2023-08-18T08:17:52.3618969+00:00&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">onramp-qa.int.capinet</stringProp>
          <stringProp name="HTTPSampler.port">8443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">bb-bancs-digital-tcs-onboarding-v1/onboarding/registerUser</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp name="TestPlan.comments">https://onramp-qa.int.capinet:8443/bb-bancs-digital-tcs-onboarding-v1/onboarding/registerUser</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${auth}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="BeanShell PreProcessor" enabled="false">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">import org.apache.jmeter.protocol.http.control.Header;
import com.github.javafaker.Faker;


ctx.getCurrentSampler().getHeaderManager().add(new Header(&quot;Authorization&quot;,&quot;Bearer &quot;+props.get(&quot;token&quot;)));
log.info(ctx.getCurrentSampler().getHeaderManager().getHeaders().toString());


 Faker faker = new Faker (new Locale(&quot;en-ZA&quot;));
 vars.put(&quot;Email_Address&quot;,faker.internet().emailAddress();

 </stringProp>
          </BeanShellPreProcessor>
          <hashTree/>
        </hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="cifData" enabled="false">
          <stringProp name="filename">/Users/cp364844/Documents/performance/platform_performance_testing/createuser/CUST_INFO_V2.csv</stringProp>
          <stringProp name="variableNames">Acct_No,Acct_No_17,Cust_No,email</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
          <stringProp name="filename">C:\apache-jmeter-5.5\bin\createuser\CIF2.csv</stringProp>
          <stringProp name="variableNames">Cust_No</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">false</boolProp>
          <boolProp name="recycle">true</boolProp>
          <boolProp name="stopThread">false</boolProp>
          <stringProp name="shareMode">shareMode.all</stringProp>
        </CSVDataSet>
        <hashTree/>
      </hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">content-type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>